app/controllers/decks_controller.rb

	def create
		@deck = Deck.new(deck_params)
		@deck.user_id = current_user.id
		if @deck.save!
---
INSERT INTO "decks" ("created_at", "updated_at", "user_id", "deck_name", "body") VALUES (?, ?, ?, ?, ?)  [["created_at", "2019-07-21 11:47:43.140454"], ["updated_at", "2019-07-21 11:47:43.140454"], ["user_id", 1], ["deck_name", "ハンデス"], ["body", "手札破壊"]]

	def show
		@deck = Deck.find(params[:id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]