app/controllers/likes_controller.rb

	def create
    	@like = current_user.likes.create(deck_id: params[:deck_id])
---
INSERT INTO "likes" ("deck_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["deck_id", 1], ["user_id", 1], ["created_at", "2019-07-21 15:26:29.840647"], ["updated_at", "2019-07-21 15:26:29.840647"]]

  	def destroy
    	@like = Like.find_by(deck_id: params[:deck_id], user_id: current_user.id)
    	@like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."deck_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["deck_id", 1], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]