app/controllers/messages_controller.rb

	def create
    if Entry.where(:user_id => current_user.id, :room_id => params[:message][:room_id]).present?
      @message = Message.create(params.require(:message).permit(:user_id, :content, :room_id).merge(:user_id => current_user.id))
---
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."room_id" = ?  [["user_id", 4], ["room_id", 6]]
INSERT INTO "messages" ("user_id", "room_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["room_id", 6], ["content", "こんにちは！！"], ["created_at", "2019-07-18 11:01:03.434551"], ["updated_at", "2019-07-18 11:01:03.434551"]]