app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-07-18 10:55:11.589342"], ["updated_at", "2019-07-18 10:55:11.589342"]]
INSERT INTO "entries" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["room_id", 1], ["created_at", "2019-07-18 10:55:11.636427"], ["updated_at", "2019-07-18 10:55:11.636427"]]
INSERT INTO "entries" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["room_id", 4], ["created_at", "2019-07-18 10:58:42.032859"], ["updated_at", "2019-07-18 10:58:42.032859"]]
---
	def create
		@room = Room.create
		@entry1 = Entry.create(:room_id => @room.id, :user_id => current_user.id)
		@entry2 = Entry.create(params.require(:entry).permit(:user_id, :room_id).merge(:room_id => @room.id))

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."room_id" = ?  [["user_id", 4], ["room_id", 6]]
---
	def show
		@room = Room.find(params[:id])
    if Entry.where(:user_id => current_user.id, :room_id => @room.id).present?