app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 4]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 3]]
---
	def show
		@user = User.find(params[:id])
		@currentUserEntry = Entry.where(user_id: current_user.id)
		@userEntry = Entry.where(user_id: @user.id)
		if @user.id == current_user.id
		else
			#多分ここの部分で”すでにチャットしていたら@isRoomをtrueを入れるみたいなことをやっている”
			@currentUserEntry.each do |cu|

SELECT "users".* FROM "users" WHERE (user_name LIKE '%1%')
---
	def search
		@users = User.search(params[:search])