app/models/user.rb

  def already_liked?(deck)
    self.likes.exists?(deck_id: deck.id)
---
SELECT  1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."deck_id" = ? LIMIT ?  [["user_id", 1], ["deck_id", 1], ["LIMIT", 1]]