app/views/decks/show.html.erb


<h3>いいね件数: <%= @deck.likes.count %></h3>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."deck_id" = ?  [["deck_id", 1]]